POS = {
    'NOUN': 'имя существительное',
    'ADJF': 'имя прилагательное (полное)',
    'ADJS':	'имя прилагательное (краткое)',
    'COMP':	'компаратив',
    'VERB': 'глагол (личная форма)',
    'INFN': 'глагол (инфинитив)',
    'PRTF': 'причастие (полное)',
    'PRTS':	'причастие (краткое)',
    'GRND': 'деепричастие',
    'NUMR': 'числительное',
    'ADVB':	'наречие',
    'NPRO':	'местоимение-существительное',
    'PRED':	'предикатив',
    'PREP':	'предлог',
    'CONJ':	'союз',
    'PRCL':	'частица',
    'INTJ':	'междометие'
}

animacy = {
    'anim': 'одушевлённое',
    'inan': 'неодушевлённое'
}

aspect = {
    'perf': 'совершенный вид',
    'impf': 'несовершенный вид'
}

case = {
    'nomn': 'именительный падеж',
    'gent': 'родительный падеж',
    'datv': 'дательный падеж',
    'accs': 'винительный падеж',
    'ablt': 'творительный падеж',
    'loct': 'предложный падеж',
    'voct': 'звательный падеж',
    'gen1': 'первый родительный падеж',
    'gen2': 'второй родительный (частичный) падеж',
    'acc2': 'второй винительный падеж',
    'loc1': 'первый предложный падеж',
    'loc2': 'второй предложный (местный) падеж'
}

gender = {
    'masc': 'мужской род',
    'femn': 'женский род',
    'neut': 'средний род',
    'ms-f': 'общий род'
}

mood = {
    'indc': 'изъявительное наклонение',
    'impr': 'повелительное наклонение'
}

number = {
    'sing': 'единственное число',
    'plur': 'множественное число'
}

person = {
    '1per': '1 лицо',
    '2per': '2 лицо',
    '3per': '3 лицо'
}

tense = {
    'pres': 'настоящее время',
    'past': 'прошедшее время',
    'futr': 'будущее время'
}

transitivity = {
    'tran': 'переходный',
    'intr': 'непереходный'
}

voice = {
    'actv': 'действительный залог',
    'pssv': 'страдательный залог'
}